app/controllers/activities_controller.rb

  def index
    # @ signifies an Instance Variable - Available on controller and the view
    # Fetch all the records and store them inside activities
    @activities = Activity.all
---
SELECT "activities".* FROM "activities"

  def create
    @activity = Activity.new(activity_params)

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("title", "activity_type", "start", "duration", "calories", "created_at", "updated_at", "user_id", "activity_type_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @activity.update(activity_params)
---
UPDATE "activities" SET "duration" = ?, "updated_at" = ? WHERE "activities"."id" = ?  [["duration", 60.0], ["updated_at", "2024-02-06 09:15:42.603762"], ["id", 5]]

  def stats
    @user_activities = current_user.activities
    @total_calories  = @user_activities.sum(:calories)
    @total_duration  = @user_activities.sum(:duration)
---
SELECT SUM("activities"."calories") FROM "activities" WHERE "activities"."user_id" = ?  [["user_id", 3]]
SELECT SUM("activities"."duration") FROM "activities" WHERE "activities"."user_id" = ?  [["user_id", 3]]