app/views/activities/_form.html.erb

SELECT "activity_types".* FROM "activity_types"
---
          <%= form.label :activity_type_id, class: "mb-2", style: "display: block" %>
          <%= form.collection_select :activity_type_id, ActivityType.all, :id, :name, { prompt: "Select activity type" }, class: "form-control mt-2" %>